export const categories = ['הכל', 'כותבת קוד', 'מדברת מתמטיקה','מהרהרת בקול', 'קצת עברית', 'מה יש לאכול'];

export const dummyPosts = [
  {
    id: 1,
    title: 'מאחורי הקלעים של ניהול זיכרון',
    excerpt: 'שליטה במרחב הוירטואלי.',
    category: 'קוד',
    readTime: '3 דקות',
    content: 'כשהתחלתי לבנות את פרויקט האסמבלר ב-C, הבנתי שפוינטרים הם קצת כמו שירה - דורשים דיוק מוחלט כדי לא ללכת לאיבוד.\n\nיש משהו כמעט מדיטטיבי בלתפוס חתיכת זיכרון וירטואלי ולהגיד "זה שלי עכשיו". עד הרגע ששוכחים לשחרר אותו, ואז המחשב מזכיר לך מי באמת שולט פה.'
  },
  {
    id: 2,
    title: 'בין אינטגרלים למציאות',
    excerpt: 'מרחב וגבולות ברורים.',
    category: 'מתמטיקה',
    readTime: '5 דקות',
    content: 'מחשבות על חדו"א ב\' וההבנה שלפעמים המרחב התלת-ממדי מסודר וצפוי הרבה יותר מהחיים עצמם.'
  },
  {
    id: 3,
    title: '55 דקות של שקט',
    excerpt: 'זמן מרוכז ונקי.',
    category: 'שירה',
    readTime: '2 דקות',
    content: 'איך טיימר פשוט עוזר לי למצוא את האיזון העדין שבין אימהות, פתרון בעיות אלגוריתמיות, ושורות של קוד.'
  }
];